app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "Very Very umm New!? Has been Edited :)"], ["updated_at", "2019-11-09 05:42:09.549803"], ["id", 5]]
---
	def update
	  @post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description))